{
  "buckets": [
    {
      "Name": "extras",
      "Source": "https://github.com/ScoopInstaller/Extras"
    },
    {
      "Name": "main",
      "Source": "https://github.com/ScoopInstaller/Main"
    },
    {
      "Name": "yak1ex",
      "Source": "https://github.com/yak1ex/scoop-bucket"
    }
  ],
  "apps": [
    {
      "Info": "",
      "Source": "main",
      "Name": "7zip"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "afxbkmk"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "afxw"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "amkln"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "amksc"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "autohotkey"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "bzeditor"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "cmigemo"
    },
    {
      "Info": "",
      "Source": "main",
      "Name": "git"
    },
    {
      "Info": "",
      "Source": "main",
      "Name": "git-lfs"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "hidemaru"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "irfanview"
    },
    {
      "Info": "",
      "Source": "main",
      "Name": "jq"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "mambaforge"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "mpc-hc-fork"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "notepadplusplus"
    },
    {
      "Info": "",
      "Source": "main",
      "Name": "nvm"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "sysinternals"
    },
    {
      "Info": "",
      "Source": "extras",
      "Name": "winmerge"
    },
    {
      "Info": "",
      "Source": "yak1ex",
      "Name": "yaksetup"
    }
  ],
  "post_install": [
    "if(-not (Test-Path -Path Registry::HKEY_CURRENT_USER\\Software\\Classes\\Applications\\Hidemaru.exe)) {",
    "  \"$env:USERPROFILE\\scoop\\apps\\hidemaru\\current\\install-file-associations.reg\"",
    "}"
  ]
}
